-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Время создания: Апр 09 2024 г., 18:31
-- Версия сервера: 10.4.32-MariaDB
-- Версия PHP: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `test2`
--

-- --------------------------------------------------------

--
-- Структура таблицы `lessons`
--

CREATE TABLE `lessons` (
  `id` int(11) NOT NULL,
  `leson` text CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `teacher` text CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `time` varchar(255) NOT NULL,
  `day` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `lessons`
--

INSERT INTO `lessons` (`id`, `leson`, `teacher`, `time`, `day`) VALUES
(1, 'Англ. яз.', 'Есикова Юлия Владимировна', '8.30-10.00', 'Вторник'),
(2, 'Дискрет. матем.с ЭМЛ', 'Кагарманов Родион Радикович', '10.10-11.40', 'Четверг'),
(3, 'Информатика', 'Гришакова Татьяна Николаевна', '10.10-11.40', 'Среда'),
(4, 'История', 'Гребенюк Богдан Валерьевич', '11.50-13.20', 'Пятница'),
(5, 'Компьютерные сети', 'Тарджиманян Лия Николаевна', '13.30-15.00', 'Четверг'),
(6, 'МДК 08.01 (ИСВ)', 'Макаревич Роман Сергеевич', '8.30-10.00', 'Понедельник'),
(7, 'МДК 09.01 (ИСВ)', 'Жирнова Юлия Витальевна', '11.50-13.20', 'Понедельник'),
(8, 'МДК 09.04 (ИСВ)', 'Тарджиманян Лия Николаевна', '11.50-13.20', 'Четверг'),
(9, 'Осн. пр. баз данных', 'Тарджиманян Лия Николаевна', '10.10-11.40', 'Понедельник'),
(10, 'МДК 09.01 (ИСВ)', 'Жирнова Юлия Витальевна', '10.10-11.40', 'Вторник'),
(11, 'Физ. культура', 'Дидаева Амина Викторовна', '8.30-10.00', 'Среда'),
(12, 'Числ. методы', 'Жирнова Юлия Витальевна', '10.10-11.40', 'Пятница'),
(13, 'Основы алгоритмизаци', 'Жирнова Юлия Витальевна', '11.50-13.20', 'Среда'),
(14, 'МДК 09.01 (ИСВ)', 'Жирнова Юлия Витальевна', '8.30-10.00', 'Четверг'),
(15, 'МДК 08.01 (ИСВ)', 'Макаревич Роман Сергеевич', '11.50-13.20', 'Вторник'),
(16, 'МДК 09.04 (ИСВ)', 'Тарджиманян Лия Николаевна', '13.30-15.00', 'Понедельник'),
(17, 'История', 'Гребенюк Богдан Валерьевич', '13.30-15.00', 'Вторник'),
(18, 'Компьютерные сети', 'Тарджиманян Лия Николаевна', '13.30-15.00', 'Среда'),
(19, 'МДК 09.04 (ИСВ)', 'Тарджиманян Лия Николаевна', '8.30-10.00', 'Пятница');

-- --------------------------------------------------------

--
-- Структура таблицы `student`
--

CREATE TABLE `student` (
  `id` int(11) NOT NULL,
  `name` text NOT NULL,
  `surname` text NOT NULL,
  `middlename` text NOT NULL,
  `birthday` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `student`
--

INSERT INTO `student` (`id`, `name`, `surname`, `middlename`, `birthday`) VALUES
(1, 'Вадим ', 'Антонюк', 'Сергеевич', '17.12.2005'),
(2, 'Иван', 'Бабенко', 'Алексеевич', '30.08.2006'),
(3, 'Глеб', 'Беломытцев', 'Олегович', '14.02.2006'),
(4, 'Никита', 'Бровин', 'Валерьевич', '02.08.2006'),
(5, 'Арина', 'Бузанова', 'Владимировна', '09.05.2006'),
(6, 'Арина', 'Гесь', 'Олеговна', '26.11.2006'),
(7, 'Анастасия', 'Григорьева', '-', '23.10.2005'),
(8, 'Дмитрий', 'Ершов', 'Олегович', '10.05.2005'),
(9, 'Вадим', 'Заяц', 'Алексеевич', '20.08.2007'),
(10, 'Андрей', 'Звонков', 'Витальевич', '15.03.2006'),
(11, 'Артем', 'Кавтарев', 'Павлович', '05.12.2006'),
(12, 'Александр', 'Корж', 'Сергеевич', '27.09.2006'),
(13, 'Алина', 'Крапивко', '-', ''),
(14, 'Данила', 'Кукушкин', 'Романович', ''),
(15, 'Полина ', 'Ли', '-', '22.03.2006'),
(16, 'Валерия', 'Лычагина', 'Анатольевна', '03.02.2006'),
(17, 'Владислав', 'Русаков', 'Алексеевич', '15.06.2006'),
(18, 'Артём', 'Сапоненко', 'Владимирович', '23.07.2006'),
(19, 'Тимофей', 'Сергеев', 'Александрович', '17.04.2006'),
(20, 'Марина', 'Трифонова', 'Павловна', '28.06.2003'),
(21, 'Денис', 'Филатов', 'Максимович', '25.10.2006'),
(22, 'Мехрзод ', 'Хошимов', '-', '01.07.2006'),
(23, 'Виталий', 'Чугунов', 'Сергеевич', '05.05.2006'),
(24, 'Егор', 'Шмелёв', '-', '21.04.2006'),
(25, 'Владислав', 'Ямковой', 'Егорович', '30.08.2006');

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `name` varchar(50) DEFAULT NULL,
  `family` varchar(20) DEFAULT NULL,
  `psw` varchar(100) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `name`, `family`, `psw`) VALUES
(0, 'Глеб', 'Беломытцев', '202cb962ac59075b964b07152d234b70'),
(23, 'Глеб', '123', '202cb962ac59075b964b07152d234b70'),
(24, 'Глеб', 'Бел', '202cb962ac59075b964b07152d234b70'),
(28, 'Глеб', 'пр', '202cb962ac59075b964b07152d234b70'),
(29, '007', 'вав', '202cb962ac59075b964b07152d234b70');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `lessons`
--
ALTER TABLE `lessons`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `student`
--
ALTER TABLE `student`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `family` (`family`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `lessons`
--
ALTER TABLE `lessons`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=20;

--
-- AUTO_INCREMENT для таблицы `student`
--
ALTER TABLE `student`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=26;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
